
% class coordinate -> gene*  

# single comment line
# object schema definition:  object_name(key[:value], ...) 
> track(name:"refseq gene")

# specify coordinates
> coordinate(group:utgb, type:chromosome, species:human, revision:hg18)
>> name:chr1
# object_name(attribute,.., object_name(attribute, ...), ...)
> gene(name, strand, start, end, cds(start,end), exon(start, end)*) 
NM_001005277	+	357521	358460	[357521, 358460]	[[357521, 358460]]
NM_001005224	+	357521	358460	[357521, 358460]	[[357521, 358460]]
NM_001005221	+	357521	358460	[357521, 358460]	[[357521, 358460]]
NM_001005277	-	610958	611897	[610958, 611897]	[[610958, 611897]]
NM_001005224	-	610958	611897	[610958, 611897]	[[610958, 611897]]
NM_001005221	-	610958	611897	[610958, 611897]	[[610958, 611897]]
NM_152486	+	850983	869824	[851184, 869396]	[[850983, 851043],[851164, 851256],[855397, 855579],[856281, 856332],[861014, 861139],[864282, 864372],[864517, 864703],[866386, 866549],[867378, 867494],[867652, 867731],[867801, 868301],[868495, 868620],[868940, 869051],[869150, 869824]]	
- description: NL_152486 has several exons

> coordinate(group:utgb, type:chromosome, species:human, revision:hg18)
>> name:chr2
> gene(name, strand, start, end, cds(start,end), exon(start, end)*) 
NM_001005224	-	610958	611897	[610958, 611897]	[[610958, 611897]]
NM_001005277	+	357521	358460	[357521, 358460]	[[357521, 358460]]




% class paper(title, author*) 
% relation paper -> reference -> paper 

> paper(id:1)
 - title: "some paper"
 > reference
  > paper(id:r1)
   - title:		"reference paper"
   - author: 	author 1
   - author: 	author 2
   - author: 	author 3
  > paper(id:r2)         
   - title:		"reference paper2"
   - author: 	author 1
> 
 - year:2009 # still in the scope of the paper (id:1)          

# begin a new paper scope
> paper(id:2)       
 - title: 	"another paper"
 - year:	2008

